import { Box, Typography } from "@mui/material";
import React from "react";

const Vopros = () => {
    return (
        <Box sx={{ width: "76%", pt: "110px", pb: "80px", color: "black" }}>
            <Typography variant="h3" sx={{ textAlign: "center" }}>
                ЧАСТО ЗАДАВАЕМЫЕ ВОПРОСЫ
            </Typography>
            <Box sx={{ pt: "20px" }}>
                <Typography sx={{ fontWeight: "bold" }}>
                    Какие платформы поддерживает Epic Games Store?
                </Typography>
                <Typography sx={{ color: "gray", pt: "10px" }}>
                    В настоящее время Epic Games Store поддерживается на ПК и
                    Mac. Вы можете проверить совместимость платформы с
                    определённой игрой в разделе «Системные требования» на
                    странице любого продукта.
                </Typography>
            </Box>
            <Box sx={{ pt: "20px" }}>
                <Typography sx={{ fontWeight: "bold" }}>
                    Каковы планы на будущее Epic Games Store?
                </Typography>
                <Typography sx={{ color: "gray", pt: "10px" }}>
                    Вы можете найти информацию о запланированных функциях,
                    обновлениях для разработчиков и основных известных проблемах
                    в плане развития Epic Games Store на Trello. Мы также будем
                    рассказывать вам о важных обновлениях в нашей ленте новостей
                    и на страницах в социальных сетях, таких как{" "}
                    <a href="https://www.facebook.com/epicgames">Facebook</a>,{" "}
                    <a href="https://twitter.com/EpicGames">Twitter</a>,{" "}
                    <a href="https://www.instagram.com/epicgames/">Instagram</a>{" "}
                    и{" "}
                    <a href="https://www.youtube.com/channel/UC5Qk8mWBwtMyEj7iQQYRk1A">
                        YouTube
                    </a>
                    .
                </Typography>
            </Box>
            <Box sx={{ pt: "20px" }}>
                <Typography sx={{ fontWeight: "bold" }}>
                    Почему Epic Games Store заключает эксклюзивные сделки?
                </Typography>
                <Typography sx={{ color: "gray" }}>
                    Эксклюзивные сделки являются фактором роста многих успешных
                    платформ для игр и других видов цифровых развлечений, таких
                    как потоковое видео и музыка. Epic сотрудничает с
                    разработчиками и издателями, чтобы предлагать в магазине
                    эксклюзивные игры. В обмен на эксклюзивность Epic
                    предоставляет им финансовую поддержку для разработки и
                    маркетинга, что позволяет создавать более качественные игры
                    и значительно снизить уровень неопределённости для
                    разработчиков.
                </Typography>
            </Box>
            <Box sx={{ pt: "20px" }}>
                <Typography sx={{ fontWeight: "bold" }}>
                    Что такое программа поддержки авторов?
                </Typography>
                <Typography sx={{ color: "gray" }}>
                    Программа поддержки авторов позволяет авторам контента
                    зарабатывать деньги на играх через Epic Games Store,
                    используя ссылки и теги автора. Узнайте больше о программе
                    поддержки авторов по{" "}
                    <a href="https://www.epicgames.com/affiliate/en-US/overview">
                        этой ссылке
                    </a>
                    .
                </Typography>
            </Box>
            <Box sx={{ pt: "20px" }}>
                <Typography sx={{ fontWeight: "bold" }}>
                    Мне досталась бесплатная игра, но я не вижу её в своей
                    учётной записи. Почему?
                </Typography>
                <Typography sx={{ color: "gray" }}>
                    Как только вы получаете бесплатную игру, то можете сохранить
                    её навсегда. Если спустя некоторое время вы не находите её в
                    своей учётной записи, проверьте, есть ли у вас другие
                    учётные записи. Если вы создали учётную запись Epic,
                    используя адрес электронной почты от gmail.com, войдите с
                    его помощью в систему напрямую, используя свой пароль Gmail,
                    так как при использовании кнопки входа с помощью Google
                    будет создана отдельная учётная запись, даже если она
                    привязана к тому же адресу электронной почты на gmail.com.
                    Кроме того, проверьте, есть ли у вас учётная запись,
                    связанная с консолью (вход в систему с помощью учётной
                    записи PlayStation, Xbox или Nintendo), наряду с отдельной
                    учётной записью Epic. Если проблема сохраняется, обратитесь
                    в службу поддержки здесь.
                </Typography>
            </Box>
            <Box sx={{ pt: "20px" }}>
                <Typography sx={{ fontWeight: "bold" }}>
                    Могу ли я опробовать игру перед покупкой?
                </Typography>
                <Typography sx={{ color: "gray" }}>
                    Некоторые издатели могут предлагать демонстрационные версии
                    или бесплатные пробные периоды для определённых платных игр
                    (например, бесплатную пробную версию на выходные). В течение
                    бесплатного пробного периода вы можете загрузить пробную
                    версию игры и поиграть в неё, прежде чем принять решение о
                    покупке, но вы не сможете получить доступ к игре после
                    окончания пробного периода.
                </Typography>
            </Box>
            <Box sx={{ pt: "20px" }}>
                <Typography sx={{ fontWeight: "bold" }}>
                    Как оформить возврат в Epic Games Store?
                </Typography>
                <Typography sx={{ color: "gray" }}>
                    Вы можете оформить возврат за любую игру в течение 14 дней с
                    момента покупки по любой причине, если игра была активна
                    менее 2 часов. Право на возмещение стоимости игр, в которых
                    вы были заблокированы или Условия использования которых вы
                    нарушили, не предоставляется. Узнайте больше о нашей
                    политике возврата средств по{" "}
                    <a href="https://www.epicgames.com/affiliate/en-US/overview">
                        этой ссылке
                    </a>
                    .
                </Typography>
            </Box>

            <Box sx={{ pt: "20px" }}>
                <Typography sx={{ fontWeight: "bold" }}>
                    Защищена ли моя учётная запись Epic Games?
                </Typography>
                <Typography sx={{ color: "gray" }}>
                    Fortnite, Rocket League, Epic Games Store и Unreal Engine
                    основаны на системе учётных записей Epic. Ещё никому не
                    удавалось её взломать. Тем не менее, злоумышленникам удалось
                    взломать некоторые отдельные учётные записи Epic с
                    использованием списков адресов электронной почты и паролей,
                    полученных с других взломанных сайтов.
                </Typography>
            </Box>
            <Box sx={{ pt: "20px" }}>
                <Typography sx={{ fontWeight: "bold" }}>
                    Где доступен Epic Games Store?
                </Typography>
                <Typography sx={{ color: "gray" }}>
                    Epic Games Store доступен игрокам в большинстве стран по
                    всему миру за исключением стран, на которые распространяется
                    запрет, предусмотренный законодательством США, например
                    Северной Кореи и Ирана. В некоторых существует
                    дополнительные правовые условия, которые необходимо
                    соблюсти, прежде чем вы сможете распространять там свою
                    игру.
                </Typography>
            </Box>
            <Box sx={{ pt: "20px" }}>
                <Typography sx={{ fontWeight: "bold" }}>
                    Как связаться со службой поддержки?
                </Typography>
                <Typography sx={{ color: "gray" }}>
                    Связаться с нашей службой поддержки можно{" "}
                    <a href="https://www.epicgames.com/help/ru/contact-us">
                        здесь
                    </a>
                    . Мы также рекомендуем ознакомиться со статьями центра
                    поддержки, которые могут помочь ответить на вопросы или
                    решить проблемы.
                </Typography>
            </Box>
            <Box sx={{ pt: "20px" }}>
                <Typography sx={{ fontWeight: "bold" }}>
                    Поддерживает ли Epic Games Store региональные цены?
                </Typography>
                <Typography sx={{ color: "gray" }}>
                    Да, мы поддерживаем региональные цены более чем в 190
                    странах и более чем на 30 территориях. У нас также есть
                    регулярно пересматриваемый набор рекомендуемых региональных
                    скидок для разработчиков с учётом особенностей каждого
                    региона.
                </Typography>
            </Box>
            <Box sx={{ pt: "20px" }}>
                <Typography sx={{ fontWeight: "bold" }}>
                    Какие языки поддерживает Epic Games Store?
                </Typography>
                <Typography sx={{ color: "gray" }}>
                    В настоящее время Epic Games Store поддерживает английский,
                    арабский, испанский (Испания), испанский (Латинская
                    Америка), итальянский, китайский (традиционный), китайский
                    (упрощённый), корейский, немецкий, польский, португальский,
                    русский, тайский, турецкий, французский и японский языки.
                    Поддержка языка в игре зависит от игры и указывается
                    разработчиком; проверьте наличие поддержки нужного вам языка
                    на странице игры в магазине.
                </Typography>
                
            </Box>
        </Box>
    );
};

export default Vopros;
